package com.ssafy.util;

public class LocalData {
	// 차례대로 전국 지역코드

	// 3개
	public static String 서울1 = "11110,서울 종로구\r\n" + "11140,서울 중구\r\n" + "11170,서울 용산구\r\n" + "11200,서울 성동구\r\n" + "11215,서울 광진구\r\n"
			+ "11230,서울 동대문구\r\n" + "11260,서울 중랑구\r\n" + "11290,서울 성북구\r\n" + "11305,서울 강북구\r\n";
	public static String 서울2 = "11320,서울 도봉구\r\n" + "11350,서울 노원구\r\n" + "11380,서울 은평구\r\n" + "11410,서울 서대문구\r\n" + "11440,서울 마포구\r\n"
			+ "11470,서울 양천구\r\n" + "11500,서울 강서구\r\n" + "11530,서울 구로구\r\n" + "11545,서울 금천구\r\n";
	public static String 서울3 = "11560,서울 영등포구\r\n" + "11590,서울 동작구\r\n" + "11620,서울 관악구\r\n" + "11650,서울 서초구\r\n" + "11680,서울 강남구\r\n"
			+ "11710,서울 송파구\r\n" + "11740,서울 강동구\r\n";

	// 2개
	public static String 부산1 = "26110,부산 중구\r\n" + "26140,부산 서구\r\n" + "26170,부산 동구\r\n" + "26200,부산 영도구\r\n" + "26230,부산 부산진구\r\n"
			+ "26260,부산 동래구\r\n" + "26290,부산 남구\r\n" + "26320,부산 북구\r\n";
	public static String 부산2 = "26350,부산 해운대구\r\n" + "26380,부산 사하구\r\n" + "26410,부산 금정구\r\n" + "26440,부산 강서구\r\n" + "26470,부산 연제구\r\n"
			+ "26500,부산 수영구\r\n" + "26530,부산 사상구\r\n" + "26710,부산 기장군\r\n";

	public static String 대구 = "27110,대구 중구\r\n" + "27140,대구 동구\r\n" + "27170,대구 서구\r\n" + "27200,대구 남구\r\n" + "27230,대구 북구\r\n"
			+ "27260,대구 수성구\r\n" + "27290,대구 달서구\r\n" + "27710,대구 달성군\r\n";

	public static String 인천 = "28110,인천 중구\r\n" + "28140,인천 동구\r\n" + "28177,인천 미추홀구\r\n" + "28185,인천 연수구\r\n" + "28200,인천 남동구\r\n"
			+ "28237,인천 부평구\r\n" + "28245,인천 계양구\r\n" + "28260,인천 서구\r\n" + "28710,인천 강화군\r\n" + "28720,인천 옹진군\r\n";

	public static String 광주 = "29110,광주 동구\r\n" + "29140,광주 서구\r\n" + "29155,광주 남구\r\n" + "29170,광주 북구\r\n" + "29200,광주 광산구\r\n";

	public static String 대전 = "30110,대전 동구\r\n" + "30140,대전 중구\r\n" + "30170,대전 서구\r\n" + "30200,대전 유성구\r\n" + "30230,대전 대덕구\r\n";

	public static String 울산 = "31110,울산 중구\r\n" + "31140,울산 남구\r\n" + "31170,울산 동구\r\n" + "31200,울산 북구\r\n" + "31710,울산 울주군\r\n";

	// 5개로
	public static String 경기1 = "41360,경기 남양주시\r\n" + "41111,경기 수원시 장안구\r\n" + "41113,경기 수원시 권선구\r\n" + "41115,경기 수원시 팔달구\r\n"
			+ "41117,경기 수원시 영통구\r\n" + "41131,경기 성남시 수정구\r\n" + "41133,경기 성남시 중원구\r\n";

	public static String 경기2 = "41135,경기 성남시 분당구\r\n" + "41150,경기 의정부시\r\n" + "41171,경기 안양시 만안구\r\n" + "41173,경기 안양시 동안구\r\n"
			+ "41190,경기 부천시\r\n" + "41210,경기 광명시\r\n" + "41220,경기 평택시\r\n" + "41250,경기 동두천시\r\n";

	public static String 경기3 = "41480,경기 파주시\r\n" + "41271,경기 안산시 상록구\r\n" + "41273,경기 안산시 단원구\r\n" + "41281,경기 고양시 덕양구\r\n"
			+ "41285,경기 고양시 일산동구\r\n" + "41287,경기 고양시 일산서구\r\n" + "41290,경기 과천시\r\n" + "41310,경기 구리시\r\n";

	public static String 경기4 = "41370,경기 오산시\r\n" + "41390,경기 시흥시\r\n" + "41410,경기 군포시\r\n" + "41430,경기 의왕시\r\n" + "41450,경기 하남시\r\n"
			+ "41461,경기 용인시 처인구\r\n" + "41463,경기 용인시 기흥구\r\n" + "41465,경기 용인시 수지구\r\n";

	public static String 경기5 = "41500,경기 이천시\r\n" + "41550,경기 안성시\r\n" + "41570,경기 김포시\r\n" + "41590,경기 화성시\r\n" + "41610,경기 광주시\r\n"
			+ "41630,경기 양주시\r\n" + "41650,경기 포천시\r\n" + "41670,경기 여주시\r\n" + "41800,경기 연천군\r\n" + "41820,경기 가평군\r\n" + "41830,경기 양평군\r\n";

	public static String 강원 = "42110,강원 춘천시\r\n" + "42130,강원 원주시\r\n" + "42150,강원 강릉시\r\n" + "42170,강원 동해시\r\n" + "42190,강원 태백시\r\n"
			+ "42210,강원 속초시\r\n" + "42230,강원 삼척시\r\n" + "42720,강원 홍천군\r\n" + "42730,강원 횡성군\r\n" + "42750,강원 영월군\r\n" + "42760,강원 평창군\r\n"
			+ "42770,강원 정선군\r\n" + "42780,강원 철원군\r\n" + "42790,강원 화천군\r\n" + "42800,강원 양구군\r\n" + "42810,강원 인제군\r\n" + "42820,강원 고성군\r\n"
			+ "42830,강원 양양군\r\n";

	public static String 충북 = "43111,충북 청주시 상당구\r\n" + "43112,충북 청주시 서원구\r\n" + "43113,충북 청주시 흥덕구\r\n" + "43114,충북 청주시 청원구\r\n"
			+ "43130,충북 충주시\r\n" + "43150,충북 제천시\r\n" + "43720,충북 보은군\r\n" + "43730,충북 옥천군\r\n" + "43740,충북 영동군\r\n" + "43745,충북 증평군\r\n"
			+ "43750,충북 진천군\r\n" + "43760,충북 괴산군\r\n" + "43770,충북 음성군\r\n" + "43800,충북 단양군\r\n";

	public static String 충남 = "44131,충남 천안시 동남구\r\n" + "44133,충남 천안시 서북구\r\n" + "44150,충남 공주시\r\n" + "44180,충남 보령시\r\n"
			+ "44200,충남 아산시\r\n" + "44210,충남 서산시\r\n" + "44230,충남 논산시\r\n" + "44250,충남 계룡시\r\n" + "44270,충남 당진시\r\n" + "44710,충남 금산군\r\n"
			+ "44760,충남 부여군\r\n" + "44770,충남 서천군\r\n" + "44790,충남 청양군\r\n" + "44800,충남 홍성군\r\n" + "44810,충남 예산군\r\n" + "44825,충남 태안군\r\n";

	public static String 전북 = "45111,전북 전주시 완산구\r\n" + "45113,전북 전주시 덕진구\r\n" + "45130,전북 군산시\r\n" + "45140,전북 익산시\r\n"
			+ "45180,전북 정읍시\r\n" + "45190,전북 남원시\r\n" + "45210,전북 김제시\r\n" + "45710,전북 완주군\r\n" + "45720,전북 진안군\r\n" + "45730,전북 무주군\r\n"
			+ "45740,전북 장수군\r\n" + "45750,전북 임실군\r\n" + "45770,전북 순창군\r\n" + "45790,전북 고창군\r\n" + "45800,전북 부안군\r\n";

	public static String 전남 = "46110,전남 목포시\r\n" + "46130,전남 여수시\r\n" + "46150,전남 순천시\r\n" + "46170,전남 나주시\r\n" + "46230,전남 광양시\r\n"
			+ "46710,전남 담양군\r\n" + "46720,전남 곡성군\r\n" + "46730,전남 구례군\r\n" + "46770,전남 고흥군\r\n" + "46780,전남 보성군\r\n" + "46790,전남 화순군\r\n"
			+ "46800,전남 장흥군\r\n" + "46810,전남 강진군\r\n" + "46820,전남 해남군\r\n" + "46830,전남 영암군\r\n" + "46840,전남 무안군\r\n" + "46860,전남 함평군\r\n"
			+ "46870,전남 영광군\r\n" + "46880,전남 장성군\r\n" + "46890,전남 완도군\r\n" + "46900,전남 진도군\r\n" + "46910,전남 신안군\r\n";

	public static String 경북 = "47111,경북 포항시 남구\r\n" + "47113,경북 포항시 북구\r\n" + "47130,경북 경주시\r\n" + "47150,경북 김천시\r\n"
			+ "47170,경북 안동시\r\n" + "47190,경북 구미시\r\n" + "47210,경북 영주시\r\n" + "47230,경북 영천시\r\n" + "47250,경북 상주시\r\n" + "47280,경북 문경시\r\n"
			+ "47290,경북 경산시\r\n" + "47720,경북 군위군\r\n" + "47730,경북 의성군\r\n" + "47750,경북 청송군\r\n" + "47760,경북 영양군\r\n" + "47770,경북 영덕군\r\n"
			+ "47820,경북 청도군\r\n" + "47830,경북 고령군\r\n" + "47840,경북 성주군\r\n" + "47850,경북 칠곡군\r\n" + "47900,경북 예천군\r\n" + "47920,경북 봉화군\r\n"
			+ "47930,경북 울진군\r\n" + "47940,경북 울릉군\r\n";

	public static String 경남 = "48121,경남 창원시 의창구\r\n" + "48123,경남 창원시 성산구\r\n" + "48125,경남 창원시 마산합포구\r\n" + "48127,경남 창원시 마산회원구\r\n"
			+ "48129,경남 창원시 진해구\r\n" + "48170,경남 진주시\r\n" + "48220,경남 통영시\r\n" + "48240,경남 사천시\r\n" + "48250,경남 김해시\r\n"
			+ "48270,경남 밀양시\r\n" + "48310,경남 거제시\r\n" + "48330,경남 양산시\r\n" + "48720,경남 의령군\r\n" + "48730,경남 함안군\r\n" + "48740,경남 창녕군\r\n"
			+ "48820,경남 고성군\r\n" + "48840,경남 남해군\r\n" + "48850,경남 하동군\r\n" + "48860,경남 산청군\r\n" + "48870,경남 함양군\r\n" + "48880,경남 거창군\r\n"
			+ "48890,경남 합천군\r\n";

	public static String 세종 = "36110,세종특별자치시\r\n";
	public static String 제주 = "50110,제주시\r\n" + "50130,서귀포시\r\n";

	public static String 전국 = 서울1 + 서울2 + 서울3 + 부산1 + 부산2 + 대구 + 인천 + 광주 + 대전 + 울산 + 세종 + 경기1 + 경기2 + 경기3 + 경기4 + 경기5
			+ 강원 + 충남 + 충북 + 전남 + 전북 + 경남 + 경북 + 제주;
}
